
cube_list = [i ** 3 for i in range(1, 1001, 2)]

sum_list = []
for num in cube_list:
    a = (num % 10)
    b = (num // 10) % 10
    c = ((num // 10) // 10) % 10
    d = ((num // 10) // 10 // 10) % 10
    e = ((num // 10) // 10 // 10 // 10) % 10
    f = ((num // 10) // 10 // 10 // 10 // 10) % 10
    g = ((num // 10) // 10 // 10 // 10 // 10 // 10) % 10
    h = ((num // 10) // 10 // 10 // 10 // 10 // 10 // 10) % 10
    k = ((num // 10) // 10 // 10 // 10 // 10 // 10 // 10 // 10) % 10
    sum_num = a + b + c + d + e + f + g + h + k
    if sum_num % 7 == 0:
        sum_list.append(num)
sum_list_17 = []
for num in cube_list:
    num += 17
    a = (num % 10)
    b = (num // 10) % 10
    c = ((num // 10) // 10) % 10
    d = ((num // 10) // 10 // 10) % 10
    e = ((num // 10) // 10 // 10 // 10) % 10
    f = ((num // 10) // 10 // 10 // 10 // 10) % 10
    g = ((num // 10) // 10 // 10 // 10 // 10 // 10) % 10
    h = ((num // 10) // 10 // 10 // 10 // 10 // 10 // 10) % 10
    k = ((num // 10) // 10 // 10 // 10 // 10 // 10 // 10 // 10) % 10
    sum_num = a + b + c + d + e + f + g + h + k
    if sum_num % 7 == 0:
        sum_list_17.append(num)



result_1 = sum(sum_list)
print('сумма чисел списка состоящего из кубов нечётных чисел от 0 до 1000, сумма цифр которых делится нацело на 7 равна: ', result_1)
result_2 = sum(sum_list_17)
print('сумма чисел списка состоящего из кубов нечётных чисел от 0 до 1000 с добавлением 17, сумма цифр которых делится нацело на 7 равна: ', result_2)